#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # google_compute_network.vpc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_network" "vpc" {
      [32m+[0m [0m[1m[0mauto_create_subnetworks[0m[0m                   = true
      [32m+[0m [0m[1m[0mdelete_default_routes_on_create[0m[0m           = false
      [32m+[0m [0m[1m[0mgateway_ipv4[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                        = (known after apply)
      [32m+[0m [0m[1m[0minternal_ipv6_range[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mmtu[0m[0m                                       = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                      = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_firewall_policy_enforcement_order[0m[0m = "AFTER_CLASSIC_FIREWALL"
      [32m+[0m [0m[1m[0mnumeric_id[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                                   = "woxap2"
      [32m+[0m [0m[1m[0mrouting_mode[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                                 = (known after apply)
    }

[1m  # google_service_account.sa[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_service_account" "sa" {
      [32m+[0m [0m[1m[0maccount_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mdisabled[0m[0m     = false
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0memail[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m      = "woxap2"
      [32m+[0m [0m[1m[0munique_id[0m[0m    = (known after apply)
    }

[1m  # random_string.sa_id[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "random_string" "sa_id" {
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlength[0m[0m      = 8
      [32m+[0m [0m[1m[0mlower[0m[0m       = true
      [32m+[0m [0m[1m[0mmin_lower[0m[0m   = 0
      [32m+[0m [0m[1m[0mmin_numeric[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_special[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_upper[0m[0m   = 0
      [32m+[0m [0m[1m[0mnumber[0m[0m      = false
      [32m+[0m [0m[1m[0mnumeric[0m[0m     = false
      [32m+[0m [0m[1m[0mresult[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mspecial[0m[0m     = false
      [32m+[0m [0m[1m[0mupper[0m[0m       = false
    }

[1m  # random_string.vpc_id[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "random_string" "vpc_id" {
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlength[0m[0m      = 8
      [32m+[0m [0m[1m[0mlower[0m[0m       = true
      [32m+[0m [0m[1m[0mmin_lower[0m[0m   = 0
      [32m+[0m [0m[1m[0mmin_numeric[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_special[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_upper[0m[0m   = 0
      [32m+[0m [0m[1m[0mnumber[0m[0m      = false
      [32m+[0m [0m[1m[0mnumeric[0m[0m     = false
      [32m+[0m [0m[1m[0mresult[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mspecial[0m[0m     = false
      [32m+[0m [0m[1m[0mupper[0m[0m       = false
    }

[1m  # module.gke_cluster.google_container_cluster.gke_cluster[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_container_cluster" "gke_cluster" {
      [32m+[0m [0m[1m[0mcluster_ipv4_cidr[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdatapath_provider[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdefault_max_pods_per_node[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m         = false
      [32m+[0m [0m[1m[0menable_intranode_visibility[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0menable_kubernetes_alpha[0m[0m     = false
      [32m+[0m [0m[1m[0menable_l4_ilb_subsetting[0m[0m    = false
      [32m+[0m [0m[1m[0menable_legacy_abac[0m[0m          = false
      [32m+[0m [0m[1m[0menable_shielded_nodes[0m[0m       = true
      [32m+[0m [0m[1m[0mendpoint[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0minitial_node_count[0m[0m          = 1
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = "us-east1"
      [32m+[0m [0m[1m[0mlogging_service[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mmaster_version[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mmonitoring_service[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "woxap2-cluster-01"
      [32m+[0m [0m[1m[0mnetwork[0m[0m                     = "default"
      [32m+[0m [0m[1m[0mnetworking_mode[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnode_locations[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mnode_version[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0moperation[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ipv6_google_access[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                     = "woxap2"
      [32m+[0m [0m[1m[0mremove_default_node_pool[0m[0m    = true
      [32m+[0m [0m[1m[0mself_link[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mservices_ipv4_cidr[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msubnetwork[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mtpu_ipv4_cidr_block[0m[0m         = (known after apply)

      [32m+[0m [0maddons_config {
          [32m+[0m [0mcloudrun_config {
              [32m+[0m [0m[1m[0mdisabled[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mload_balancer_type[0m[0m = (known after apply)
            }

          [32m+[0m [0mconfig_connector_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mdns_cache_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mgce_persistent_disk_csi_driver_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mgcp_filestore_csi_driver_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mgcs_fuse_csi_driver_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mgke_backup_agent_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mhorizontal_pod_autoscaling {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mhttp_load_balancing {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mnetwork_policy_config {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mauthenticator_groups_config {
          [32m+[0m [0m[1m[0msecurity_group[0m[0m = (known after apply)
        }

      [32m+[0m [0mcluster_autoscaling {
          [32m+[0m [0m[1m[0mautoscaling_profile[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m             = (known after apply)

          [32m+[0m [0mauto_provisioning_defaults {
              [32m+[0m [0m[1m[0mboot_disk_kms_key[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mdisk_size[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0mdisk_type[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0mimage_type[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mservice_account[0m[0m   = (known after apply)

              [32m+[0m [0mmanagement {
                  [32m+[0m [0m[1m[0mauto_repair[0m[0m     = (known after apply)
                  [32m+[0m [0m[1m[0mauto_upgrade[0m[0m    = (known after apply)
                  [32m+[0m [0m[1m[0mupgrade_options[0m[0m = (known after apply)
                }

              [32m+[0m [0mshielded_instance_config {
                  [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
                }

              [32m+[0m [0mupgrade_settings {
                  [32m+[0m [0m[1m[0mmax_surge[0m[0m       = (known after apply)
                  [32m+[0m [0m[1m[0mmax_unavailable[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mstrategy[0m[0m        = (known after apply)

                  [32m+[0m [0mblue_green_settings {
                      [32m+[0m [0m[1m[0mnode_pool_soak_duration[0m[0m = (known after apply)

                      [32m+[0m [0mstandard_rollout_policy {
                          [32m+[0m [0m[1m[0mbatch_node_count[0m[0m    = (known after apply)
                          [32m+[0m [0m[1m[0mbatch_percentage[0m[0m    = (known after apply)
                          [32m+[0m [0m[1m[0mbatch_soak_duration[0m[0m = (known after apply)
                        }
                    }
                }
            }

          [32m+[0m [0mresource_limits {
              [32m+[0m [0m[1m[0mmaximum[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mminimum[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mresource_type[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mconfidential_nodes {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mcost_management_config {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mdatabase_encryption {
          [32m+[0m [0m[1m[0mkey_name[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mstate[0m[0m    = (known after apply)
        }

      [32m+[0m [0mdefault_snat_status {
          [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mgateway_api_config {
          [32m+[0m [0m[1m[0mchannel[0m[0m = (known after apply)
        }

      [32m+[0m [0midentity_service_config {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mip_allocation_policy {
          [32m+[0m [0m[1m[0mcluster_ipv4_cidr_block[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mcluster_secondary_range_name[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mservices_ipv4_cidr_block[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mservices_secondary_range_name[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mstack_type[0m[0m                    = (known after apply)

          [32m+[0m [0madditional_pod_ranges_config {
              [32m+[0m [0m[1m[0mpod_range_names[0m[0m = (known after apply)
            }

          [32m+[0m [0mpod_cidr_overprovision_config {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mlogging_config {
          [32m+[0m [0m[1m[0menable_components[0m[0m = (known after apply)
        }

      [32m+[0m [0mmaster_auth {
          [32m+[0m [0m[1m[0mclient_certificate[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mclient_key[0m[0m             = (sensitive value)
          [32m+[0m [0m[1m[0mcluster_ca_certificate[0m[0m = (known after apply)

          [32m+[0m [0mclient_certificate_config {
              [32m+[0m [0m[1m[0missue_client_certificate[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mmaster_authorized_networks_config {
          [32m+[0m [0m[1m[0mgcp_public_cidrs_access_enabled[0m[0m = (known after apply)

          [32m+[0m [0mcidr_blocks {
              [32m+[0m [0m[1m[0mcidr_block[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mdisplay_name[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mmesh_certificates {
          [32m+[0m [0m[1m[0menable_certificates[0m[0m = (known after apply)
        }

      [32m+[0m [0mmonitoring_config {
          [32m+[0m [0m[1m[0menable_components[0m[0m = (known after apply)

          [32m+[0m [0madvanced_datapath_observability_config {
              [32m+[0m [0m[1m[0menable_metrics[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mrelay_mode[0m[0m     = (known after apply)
            }

          [32m+[0m [0mmanaged_prometheus {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnode_config {
          [32m+[0m [0m[1m[0mboot_disk_kms_key[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mdisk_type[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0meffective_taints[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mguest_accelerator[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mimage_type[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mlabels[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mlogging_variant[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mmachine_type[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mmetadata[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mnode_group[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0moauth_scopes[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mresource_labels[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mservice_account[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mspot[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m              = (known after apply)

          [32m+[0m [0madvanced_machine_features {
              [32m+[0m [0m[1m[0mthreads_per_core[0m[0m = (known after apply)
            }

          [32m+[0m [0mconfidential_nodes {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mephemeral_storage_local_ssd_config {
              [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m = (known after apply)
            }

          [32m+[0m [0mfast_socket {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mgcfs_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mgvnic {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mhost_maintenance_policy {
              [32m+[0m [0m[1m[0mmaintenance_interval[0m[0m = (known after apply)
            }

          [32m+[0m [0mkubelet_config {
              [32m+[0m [0m[1m[0mcpu_cfs_quota[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0mcpu_cfs_quota_period[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mcpu_manager_policy[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mpod_pids_limit[0m[0m       = (known after apply)
            }

          [32m+[0m [0mlinux_node_config {
              [32m+[0m [0m[1m[0mcgroup_mode[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0msysctls[0m[0m     = (known after apply)
            }

          [32m+[0m [0mlocal_nvme_ssd_block_config {
              [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m = (known after apply)
            }

          [32m+[0m [0mreservation_affinity {
              [32m+[0m [0m[1m[0mconsume_reservation_type[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mkey[0m[0m                      = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m                   = (known after apply)
            }

          [32m+[0m [0mshielded_instance_config {
              [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
            }

          [32m+[0m [0msole_tenant_config {
              [32m+[0m [0mnode_affinity {
                  [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)
                  [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)
                }
            }

          [32m+[0m [0mtaint {
              [32m+[0m [0m[1m[0meffect[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mvalue[0m[0m  = (known after apply)
            }

          [32m+[0m [0mworkload_metadata_config {
              [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnode_pool {
          [32m+[0m [0m[1m[0minitial_node_count[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0minstance_group_urls[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mmanaged_instance_group_urls[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_pods_per_node[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mname_prefix[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mnode_count[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mnode_locations[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mversion[0m[0m                     = (known after apply)

          [32m+[0m [0mautoscaling {
              [32m+[0m [0m[1m[0mlocation_policy[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mmax_node_count[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mmin_node_count[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mtotal_max_node_count[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mtotal_min_node_count[0m[0m = (known after apply)
            }

          [32m+[0m [0mmanagement {
              [32m+[0m [0m[1m[0mauto_repair[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0mauto_upgrade[0m[0m = (known after apply)
            }

          [32m+[0m [0mnetwork_config {
              [32m+[0m [0m[1m[0mcreate_pod_range[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0menable_private_nodes[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mpod_ipv4_cidr_block[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0mpod_range[0m[0m            = (known after apply)

              [32m+[0m [0mnetwork_performance_config {
                  [32m+[0m [0m[1m[0mtotal_egress_bandwidth_tier[0m[0m = (known after apply)
                }

              [32m+[0m [0mpod_cidr_overprovision_config {
                  [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
                }
            }

          [32m+[0m [0mnode_config {
              [32m+[0m [0m[1m[0mboot_disk_kms_key[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mdisk_type[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0meffective_taints[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0mguest_accelerator[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mimage_type[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0mlabels[0m[0m            = (known after apply)
              [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mlogging_variant[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mmachine_type[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mmetadata[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0mnode_group[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mpreemptible[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mresource_labels[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mservice_account[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mspot[0m[0m              = (known after apply)
              [32m+[0m [0m[1m[0mtags[0m[0m              = (known after apply)

              [32m+[0m [0madvanced_machine_features {
                  [32m+[0m [0m[1m[0mthreads_per_core[0m[0m = (known after apply)
                }

              [32m+[0m [0mconfidential_nodes {
                  [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
                }

              [32m+[0m [0mephemeral_storage_local_ssd_config {
                  [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m = (known after apply)
                }

              [32m+[0m [0mfast_socket {
                  [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
                }

              [32m+[0m [0mgcfs_config {
                  [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
                }

              [32m+[0m [0mgvnic {
                  [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
                }

              [32m+[0m [0mhost_maintenance_policy {
                  [32m+[0m [0m[1m[0mmaintenance_interval[0m[0m = (known after apply)
                }

              [32m+[0m [0mkubelet_config {
                  [32m+[0m [0m[1m[0mcpu_cfs_quota[0m[0m        = (known after apply)
                  [32m+[0m [0m[1m[0mcpu_cfs_quota_period[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mcpu_manager_policy[0m[0m   = (known after apply)
                  [32m+[0m [0m[1m[0mpod_pids_limit[0m[0m       = (known after apply)
                }

              [32m+[0m [0mlinux_node_config {
                  [32m+[0m [0m[1m[0mcgroup_mode[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0msysctls[0m[0m     = (known after apply)
                }

              [32m+[0m [0mlocal_nvme_ssd_block_config {
                  [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m = (known after apply)
                }

              [32m+[0m [0mreservation_affinity {
                  [32m+[0m [0m[1m[0mconsume_reservation_type[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mkey[0m[0m                      = (known after apply)
                  [32m+[0m [0m[1m[0mvalues[0m[0m                   = (known after apply)
                }

              [32m+[0m [0mshielded_instance_config {
                  [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
                }

              [32m+[0m [0msole_tenant_config {
                  [32m+[0m [0mnode_affinity {
                      [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)
                      [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)
                      [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)
                    }
                }

              [32m+[0m [0mtaint {
                  [32m+[0m [0m[1m[0meffect[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)
                  [32m+[0m [0m[1m[0mvalue[0m[0m  = (known after apply)
                }

              [32m+[0m [0mworkload_metadata_config {
                  [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
                }
            }

          [32m+[0m [0mplacement_policy {
              [32m+[0m [0m[1m[0mpolicy_name[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0mtpu_topology[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
            }

          [32m+[0m [0mupgrade_settings {
              [32m+[0m [0m[1m[0mmax_surge[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mmax_unavailable[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mstrategy[0m[0m        = (known after apply)

              [32m+[0m [0mblue_green_settings {
                  [32m+[0m [0m[1m[0mnode_pool_soak_duration[0m[0m = (known after apply)

                  [32m+[0m [0mstandard_rollout_policy {
                      [32m+[0m [0m[1m[0mbatch_node_count[0m[0m    = (known after apply)
                      [32m+[0m [0m[1m[0mbatch_percentage[0m[0m    = (known after apply)
                      [32m+[0m [0m[1m[0mbatch_soak_duration[0m[0m = (known after apply)
                    }
                }
            }
        }

      [32m+[0m [0mnode_pool_auto_config {
          [32m+[0m [0mnetwork_tags {
              [32m+[0m [0m[1m[0mtags[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnode_pool_defaults {
          [32m+[0m [0mnode_config_defaults {
              [32m+[0m [0m[1m[0mlogging_variant[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnotification_config {
          [32m+[0m [0mpubsub {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mtopic[0m[0m   = (known after apply)

              [32m+[0m [0mfilter {
                  [32m+[0m [0m[1m[0mevent_type[0m[0m = (known after apply)
                }
            }
        }

      [32m+[0m [0mrelease_channel {
          [32m+[0m [0m[1m[0mchannel[0m[0m = (known after apply)
        }

      [32m+[0m [0msecurity_posture_config {
          [32m+[0m [0m[1m[0mmode[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mvulnerability_mode[0m[0m = (known after apply)
        }

      [32m+[0m [0mservice_external_ips_config {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mvertical_pod_autoscaling {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mworkload_identity_config {
          [32m+[0m [0m[1m[0mworkload_pool[0m[0m = (known after apply)
        }
    }

[1m  # module.gke_cluster.google_container_node_pool.gke_node_pool[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_container_node_pool" "gke_node_pool" {
      [32m+[0m [0m[1m[0mcluster[0m[0m                     = "woxap2-cluster-01"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0minitial_node_count[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0minstance_group_urls[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = "us-east1"
      [32m+[0m [0m[1m[0mmanaged_instance_group_urls[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmax_pods_per_node[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "woxap2-node-pool-01"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mnode_count[0m[0m                  = 2
      [32m+[0m [0m[1m[0mnode_locations[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0moperation[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                     = "woxap2"
      [32m+[0m [0m[1m[0mversion[0m[0m                     = (known after apply)

      [32m+[0m [0mmanagement {
          [32m+[0m [0m[1m[0mauto_repair[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mauto_upgrade[0m[0m = (known after apply)
        }

      [32m+[0m [0mnetwork_config {
          [32m+[0m [0m[1m[0mcreate_pod_range[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0menable_private_nodes[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mpod_ipv4_cidr_block[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mpod_range[0m[0m            = (known after apply)

          [32m+[0m [0mnetwork_performance_config {
              [32m+[0m [0m[1m[0mtotal_egress_bandwidth_tier[0m[0m = (known after apply)
            }

          [32m+[0m [0mpod_cidr_overprovision_config {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnode_config {
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m      = 20
          [32m+[0m [0m[1m[0mdisk_type[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0meffective_taints[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mguest_accelerator[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mimage_type[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mlabels[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mlogging_variant[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mmachine_type[0m[0m      = "n1-standard-2"
          [32m+[0m [0m[1m[0mmetadata[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0moauth_scopes[0m[0m      = [
              [32m+[0m [0m"https://www.googleapis.com/auth/cloud-platform",
            ]
          [32m+[0m [0m[1m[0mpreemptible[0m[0m       = false
          [32m+[0m [0m[1m[0mservice_account[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mspot[0m[0m              = false

          [32m+[0m [0mconfidential_nodes {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mshielded_instance_config {
              [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
            }

          [32m+[0m [0mworkload_metadata_config {
              [32m+[0m [0m[1m[0mmode[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mupgrade_settings {
          [32m+[0m [0m[1m[0mmax_surge[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mmax_unavailable[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mstrategy[0m[0m        = (known after apply)

          [32m+[0m [0mblue_green_settings {
              [32m+[0m [0m[1m[0mnode_pool_soak_duration[0m[0m = (known after apply)

              [32m+[0m [0mstandard_rollout_policy {
                  [32m+[0m [0m[1m[0mbatch_node_count[0m[0m    = (known after apply)
                  [32m+[0m [0m[1m[0mbatch_percentage[0m[0m    = (known after apply)
                  [32m+[0m [0m[1m[0mbatch_soak_duration[0m[0m = (known after apply)
                }
            }
        }
    }

[0m[1mPlan:[0m 6 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [32m+[0m [0m[1m[0mservice_account_info[0m[0m = {
      [32m+[0m [0maccount_id   = (known after apply)
      [32m+[0m [0mdisplay_name = (known after apply)
      [32m+[0m [0memail        = (known after apply)
    }
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.


```

<details>

*Pushed by: @wOXap2, Action: `pull_request`*